# GetAddedElementIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UpdaterData..::..GetAddedElementIds Method
UpdaterData Class See Also
---
Returns set of elements newly added to the document. This set is mutually exclusive of elements returned by getDeletedElementIds() and getModifiedElementIds().
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ICollection<ElementId> GetAddedElementIds()
```

Visual Basic
---
```text
Public Function GetAddedElementIds As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetAddedElementIds()
```

# ### Return Value
Set of elements that were added to the document and triggered the call to execute() Note: This will only return elements if the trigger registered for the associated updater contains the ChangeType returned by Element::getChangeTypeElementAddition()
# See Also
UpdaterData Class
Autodesk.Revit.DB Namespace